Learning Rails (Demo App)/app/controllers/articles_controller.rb

INSERT INTO "articles" ("description", "created_at", "updated_at", "title", "user_id") VALUES (?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)
    @article.user = User.last                    # Temporary assignment of user to articles

    if @article.save